Tekla Open API Reference for Tekla Structures 2025
MaterialItem.ModulusOfElasticity Property
 Thte modulus of elasticity in unit N/m2.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ModulusOfElasticity { get; set; }
Public Property ModulusOfElasticity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace